# CannotPutSpaceInOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..CannotPutSpaceInOption Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
MEP space must be in the Main Model
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPutSpaceInOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPutSpaceInOption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPutSpaceInOption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace